; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v11 ?v6)
             (pred_6 ?v12 ?v4)
             (pred_2 ?v11 ?v4)
             (pred_4 ?v10 ?v11 )
	     (pred_8 ?v11)
             (pred_10 ?v13)
             (pred_11 ?v12)
             (pred_7 ?v4)
             (pred_9 ?v11)
             (pred_5 ?v12)
             (pred_12 ?v11)
             (pred_1 ))



(:action op_2
:parameters (?v8 ?v1 ?v2 ?v9)
:precondition (and (pred_10 ?v8) (pred_10 ?v1) (pred_11 ?v2) (pred_7 ?v9)
          (pred_3 ?v8 ?v1) (pred_6 ?v2 ?v9)
                   (pred_2 ?v1 ?v9) (pred_8 ?v8) 
                   (pred_9 ?v1) (pred_5 ?v2))
:effect (and  (pred_12 ?v1) (not (pred_9 ?v1))))


(:action op_5
:parameters (?v8 ?v5)
:precondition (and (pred_10 ?v8) (pred_10 ?v5)
               (pred_8 ?v8) (pred_3 ?v8 ?v5) (pred_12 ?v5))
:effect (and (pred_8 ?v5) (not (pred_8 ?v8))))

(:action op_3
:parameters (?v8 ?v2)
:precondition (and (pred_10 ?v8) (pred_11 ?v2) 
                  (pred_8 ?v8) (pred_4 ?v2 ?v8) (pred_1 ))
:effect (and (pred_5 ?v2)
   (not (pred_4 ?v2 ?v8)) (not (pred_1 ))))


(:action op_4
:parameters (?v8 ?v7 ?v3)
:precondition (and (pred_10 ?v8) (pred_11 ?v7) (pred_11 ?v3)
                  (pred_8 ?v8) (pred_5 ?v3) (pred_4 ?v7 ?v8))
:effect (and (pred_5 ?v7) (pred_4 ?v3 ?v8)
        (not (pred_5 ?v3)) (not (pred_4 ?v7 ?v8))))

(:action op_1
:parameters (?v8 ?v2)
:precondition (and (pred_10 ?v8) (pred_11 ?v2) 
                  (pred_8 ?v8) (pred_5 ?v2))
:effect (and (pred_1 ) (pred_4 ?v2 ?v8) (not (pred_5 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_13 obj_26 obj_01 obj_31 obj_29 obj_27 obj_07 obj_15 obj_19 obj_30 obj_04 obj_03 obj_14 obj_24 obj_16 obj_06 obj_23 obj_28 obj_22 obj_09 obj_21 obj_08 obj_17 obj_18
    obj_25 obj_10 obj_20
    obj_05 obj_11 obj_12
    )

    (:init
       (pred_1)

       (pred_10 obj_02)
       (pred_10 obj_13)
       (pred_10 obj_26)
       (pred_10 obj_01)
       (pred_10 obj_31)
       (pred_10 obj_29)
       (pred_10 obj_27)
       (pred_10 obj_07)
       (pred_10 obj_15)
       (pred_10 obj_19)
       (pred_10 obj_30)
       (pred_10 obj_04)
       (pred_10 obj_03)
       (pred_10 obj_14)
       (pred_10 obj_24)
       (pred_10 obj_16)
       (pred_10 obj_06)
       (pred_10 obj_23)
       (pred_10 obj_28)
       (pred_10 obj_22)
       (pred_10 obj_09)
       (pred_10 obj_21)
       (pred_10 obj_08)
       (pred_10 obj_17)
       (pred_10 obj_18)
       (pred_7 obj_25)
       (pred_7 obj_10)
       (pred_7 obj_20)
       (pred_11 obj_05)
       (pred_11 obj_11)
       (pred_11 obj_12)

       (pred_3 obj_02 obj_29)
       (pred_3 obj_02 obj_13)
       (pred_3 obj_13 obj_27)
       (pred_3 obj_13 obj_26)
       (pred_3 obj_13 obj_02)
       (pred_3 obj_26 obj_07)
       (pred_3 obj_26 obj_01)
       (pred_3 obj_26 obj_13)
       (pred_3 obj_01 obj_15)
       (pred_3 obj_01 obj_31)
       (pred_3 obj_01 obj_26)
       (pred_3 obj_31 obj_19)
       (pred_3 obj_31 obj_01)
       (pred_3 obj_29 obj_30)
       (pred_3 obj_29 obj_27)
       (pred_3 obj_29 obj_02)
       (pred_3 obj_27 obj_04)
       (pred_3 obj_27 obj_07)
       (pred_3 obj_27 obj_13)
       (pred_3 obj_27 obj_29)
       (pred_3 obj_07 obj_03)
       (pred_3 obj_07 obj_15)
       (pred_3 obj_07 obj_26)
       (pred_3 obj_07 obj_27)
       (pred_3 obj_15 obj_14)
       (pred_3 obj_15 obj_19)
       (pred_3 obj_15 obj_01)
       (pred_3 obj_15 obj_07)
       (pred_3 obj_19 obj_24)
       (pred_3 obj_19 obj_31)
       (pred_3 obj_19 obj_15)
       (pred_3 obj_30 obj_16)
       (pred_3 obj_30 obj_04)
       (pred_3 obj_30 obj_29)
       (pred_3 obj_04 obj_06)
       (pred_3 obj_04 obj_03)
       (pred_3 obj_04 obj_27)
       (pred_3 obj_04 obj_30)
       (pred_3 obj_03 obj_23)
       (pred_3 obj_03 obj_14)
       (pred_3 obj_03 obj_07)
       (pred_3 obj_03 obj_04)
       (pred_3 obj_14 obj_28)
       (pred_3 obj_14 obj_24)
       (pred_3 obj_14 obj_15)
       (pred_3 obj_14 obj_03)
       (pred_3 obj_24 obj_22)
       (pred_3 obj_24 obj_19)
       (pred_3 obj_24 obj_14)
       (pred_3 obj_16 obj_09)
       (pred_3 obj_16 obj_06)
       (pred_3 obj_16 obj_30)
       (pred_3 obj_06 obj_21)
       (pred_3 obj_06 obj_23)
       (pred_3 obj_06 obj_04)
       (pred_3 obj_06 obj_16)
       (pred_3 obj_23 obj_08)
       (pred_3 obj_23 obj_28)
       (pred_3 obj_23 obj_03)
       (pred_3 obj_23 obj_06)
       (pred_3 obj_28 obj_17)
       (pred_3 obj_28 obj_22)
       (pred_3 obj_28 obj_14)
       (pred_3 obj_28 obj_23)
       (pred_3 obj_22 obj_18)
       (pred_3 obj_22 obj_24)
       (pred_3 obj_22 obj_28)
       (pred_3 obj_09 obj_21)
       (pred_3 obj_09 obj_16)
       (pred_3 obj_21 obj_08)
       (pred_3 obj_21 obj_06)
       (pred_3 obj_21 obj_09)
       (pred_3 obj_08 obj_17)
       (pred_3 obj_08 obj_23)
       (pred_3 obj_08 obj_21)
       (pred_3 obj_17 obj_18)
       (pred_3 obj_17 obj_28)
       (pred_3 obj_17 obj_08)
       (pred_3 obj_18 obj_22)
       (pred_3 obj_18 obj_17)
       (pred_9 obj_21)
       (pred_9 obj_22)
       (pred_9 obj_31)
       (pred_2  obj_21 obj_25)
       (pred_2  obj_22 obj_10)
       (pred_2  obj_31 obj_20)
       (pred_12 obj_02)
       (pred_12 obj_13)
       (pred_12 obj_26)
       (pred_12 obj_01)
       (pred_12 obj_29)
       (pred_12 obj_27)
       (pred_12 obj_07)
       (pred_12 obj_15)
       (pred_12 obj_19)
       (pred_12 obj_30)
       (pred_12 obj_04)
       (pred_12 obj_03)
       (pred_12 obj_14)
       (pred_12 obj_24)
       (pred_12 obj_16)
       (pred_12 obj_06)
       (pred_12 obj_23)
       (pred_12 obj_28)
       (pred_12 obj_09)
       (pred_12 obj_08)
       (pred_12 obj_17)
       (pred_12 obj_18)

       (pred_6  obj_05 obj_25)
       (pred_6  obj_11 obj_10)
       (pred_6  obj_12 obj_20)
       (pred_4 obj_05 obj_24)
       (pred_4 obj_11 obj_19)
       (pred_4 obj_12 obj_19)
       (pred_8 obj_29)
    )

    (:goal (and
       (pred_4 obj_11 obj_02)
       (pred_4 obj_12 obj_06)
    ))
(:constraints
  (always (not (pred_8 obj_15)))
)
)

; plan
1. (op_5 obj_29 obj_27)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_27)
   goals met: 0 of 2
2. (op_5 obj_27 obj_04)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_04)
   goals met: 0 of 2
3. (op_5 obj_04 obj_03)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_03)
   goals met: 0 of 2
4. (op_5 obj_03 obj_14)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_14)
   goals met: 0 of 2
5. (op_5 obj_14 obj_24)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_24)
   goals met: 0 of 2
6. (op_5 obj_24 obj_19)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_19)
   goals met: 0 of 2
7. (op_3 obj_19 obj_12)
   deleted: (pred_4 obj_12 obj_19) (pred_1)
   added: (pred_5 obj_12)
   goals met: 0 of 2
8. (op_5 obj_19 obj_24)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_24)
   goals met: 0 of 2
9. (op_5 obj_24 obj_14)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_14)
   goals met: 0 of 2
10. (op_5 obj_14 obj_03)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_03)
   goals met: 0 of 2
11. (op_5 obj_03 obj_04)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_04)
   goals met: 0 of 2
12. (op_5 obj_04 obj_06)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_06)
   goals met: 0 of 2
13. (op_1 obj_06 obj_12)
   deleted: (pred_5 obj_12)
   added: (pred_1) (pred_4 obj_12 obj_06)
   goals met: 1 of 2
14. (op_5 obj_06 obj_23)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_23)
   goals met: 1 of 2
15. (op_5 obj_23 obj_03)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_03)
   goals met: 1 of 2
16. (op_5 obj_03 obj_14)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_14)
   goals met: 1 of 2
17. (op_5 obj_14 obj_24)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_24)
   goals met: 1 of 2
18. (op_5 obj_24 obj_19)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_19)
   goals met: 1 of 2
19. (op_3 obj_19 obj_11)
   deleted: (pred_4 obj_11 obj_19) (pred_1)
   added: (pred_5 obj_11)
   goals met: 1 of 2
20. (op_5 obj_19 obj_24)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_24)
   goals met: 1 of 2
21. (op_5 obj_24 obj_14)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_14)
   goals met: 1 of 2
22. (op_5 obj_14 obj_03)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_03)
   goals met: 1 of 2
23. (op_5 obj_03 obj_07)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_07)
   goals met: 1 of 2
24. (op_5 obj_07 obj_26)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_26)
   goals met: 1 of 2
25. (op_5 obj_26 obj_13)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_13)
   goals met: 1 of 2
26. (op_5 obj_13 obj_02)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_02)
   goals met: 1 of 2
27. (op_1 obj_02 obj_11)
   deleted: (pred_5 obj_11)
   added: (pred_1) (pred_4 obj_11 obj_02)
   goals met: 2 of 2
